DataProcessors/ПросроченныеОплатыПоВсемОптовикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПросроченныеОплатыПоВсемОптовикам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокОплатыЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатитьДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыКомпании</Name>
			<Comment>Блок учета взаиморасчетов с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма долга в валюте взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма долга в валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБаз</Name>
					<Comment>Содержит сумму в базовой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции взаиморасчетов (оплата, предоплата...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, с которым мы ведем взаиморасчеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ отгрузки/поставки/оплаты по которому образовался долг</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/ПросроченныеОплатыПоВсемОптовикам/Ext/ObjectModule.bsl
Процедура СформироватьПросрочкиМодуль() Экспорт
		
	Для каждого Стр Из Контрагенты Цикл
		
		Контрагент = Стр.Значение;
		
		Если Не обЗначениеНеЗаполнено(Контрагент) Тогда
			
			Если Не обЗначениеНеЗаполнено(ДатаРасчета) Тогда
				
				СтрОстатокЧисло = 0;
				СтруктураОтбора = Новый Структура("Контрагент",Контрагент);
				МоментВремени = Новый МоментВремени(КонецДня(РабочаяДата));
				тзОбщДолги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(МоментВремени,СтруктураОтбора,,"Сумма");
				СтрОстатокЧисло = тзОбщДолги.Итог("Сумма");
				СтрОстаток = Формат(СтрОстаток,"ЧЦ=15; ЧДЦ=2");
				
				Всего=тзОбщДолги.Количество();        
				Сч=1;        
				Пока Сч <= Всего цикл        
					Состояние("Обработка строк: "+строка(сч)+" из "+Строка(Всего));
					Попытка
						Стр = тзОбщДолги[сч-1];
					Исключение
						//
					КонецПопытки; 
					Если Число(СокрЛП(Стр.Сумма)) <= 0 Тогда
						тзОбщДолги.Удалить(Стр);
						Всего = Всего - 1;
					Иначе
						Сч = Сч + 1;
					КонецЕсли;    
				КонецЦикла;
				
				тзОбщДолги.Колонки.Добавить("ДатаСделки");
				тзОбщДолги.Колонки.Добавить("СрокОплатыЗадолженности");
				тзОбщДолги.Колонки.Добавить("ОплатитьДо");
				тзОбщДолги.Колонки.Добавить("ПросроченнаяЗадолженность");
				
				Если обЗначениеНеЗаполнено(ДатаРасчета) Тогда
					ДатаРасчета = КонецДня(ТекущаяДата());
				Иначе
					ДатаРасчета = КонецДня(ДатаРасчета);
				КонецЕсли; 
				
				ТекСумма = СтрОстатокЧисло;
				ЕстьПросрочка = Ложь;
				Для каждого Стр Из тзОбщДолги Цикл
					Стр.ДатаСделки = КонецДня(Стр.Сделка.Дата);
					Стр.СрокОплатыЗадолженности = Стр.ДоговорВзаиморасчетов.СрокОплатыЗадолженности;
					Если Стр.ДоговорВзаиморасчетов.СрокОплатыЗадолженности > 0 Тогда
						Стр.ОплатитьДо = Стр.ДатаСделки+Число(СтрЗаменить(Стр.СрокОплатыЗадолженности,Символы.НПП,""))*86400;
						Если КонецДня(Стр.ОплатитьДо) < ДатаРасчета Тогда
							Стр.ПросроченнаяЗадолженность = Истина;
							ЕстьПросрочка = Истина;
						Иначе
							Стр.ПросроченнаяЗадолженность = Ложь;
						КонецЕсли; 
					Иначе
						Стр.ПросроченнаяЗадолженность = Ложь;
					КонецЕсли;
					ТекСумма = ТекСумма - Стр.Сумма;
					Если ТекСумма <= 0 Тогда
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
				
				тзОбщДолги.Сортировать("ДатаСделки Убыв");
				
				Если ЕстьПросрочка Тогда
					Для каждого Стр Из тзОбщДолги Цикл
						Если Не обЗначениеНеЗаполнено(Стр.ПросроченнаяЗадолженность) Тогда
							Если Стр.ПросроченнаяЗадолженность Тогда
								Сообщить("Для контагента "+Контрагент+" по сделке "+Стр.Сделка+", на сумму "+Стр.Сделка.СуммаДокумента+" руб., отсрочка платежа составляет "+Стр.СрокОплатыЗадолженности+" дней и дата платежа "+Формат(Стр.ОплатитьДо,"ДЛФ=DD=D")+" просрочена.",СтатусСообщения.ОченьВажное);
							КонецЕсли; 
 						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 		
				
			КонецЕсли; 		
			
		КонецЕсли; 		
		
	КонецЦикла; 
 
КонецПроцедуры
